Repository: nawinds/nawinds-site
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru

# not_found_header
source: Not found
ru: Страница не найдена

# not_found_desc
source: This page does not exist. You can go to <a href="/">HomePage</a>.
ru: Этой страницы не существует. Вы можете перейти на <a href="/">главную</a>.

# lang_code
source: en
ru: ru

# page_description
source: Personal website of Nikita Aksenov (@nawinds). Info about me and social links
ru: Персональный сайт Никиты Аксенова (@nawinds). Информация обо мне и ссылки на соцсети

# page_keywords
source: nawinds, @nawinds, Nikita Aksenov site, Aksenov Nikita, personal website
ru: nawinds, @nawinds, Никита Аксенов сайт, Аксенов Никита, персональный сайт

# page_title
source: Nawinds | Nikita Aksenov
ru: Nawinds | Никита Аксенов

source: Up
ru: Наверх

# language_switch_link
source: ru
ru: en

# language_switch_text
source: РУС
ru: ENG

# language_switch_popup_text
source: Переключить на русский?
ru: Switch to English?

# language_switch_popup_ok
source: Да
ru: Yes

# language_switch_popup_dismiss
source: Dismiss
ru: Закрыть

# name_header
source: Nikita&nbsp;Aksenov
ru: Никита&nbsp;Аксенов

source: Scroll further
ru: Листать дальше

# about_header
source: About me
ru: О себе

source: Age
ru: Возраст

# age_years
source: years old
ru: лет

# city
source: Moscow
ru: Москва

# city_desc
source: From Moscow
ru: Из Москвы

# programmer_desc
source: Mainly code in Python
ru: Программист, в основном пишу на Python

source: Sailing
ru: Парусный спорт

# sailing_desc
source: Professional yachtsman, sail on Laser 4.7, Laser Radial and Firefly
ru: Профессионально занимаюсь парусным спортом, гоняюсь в классах яхт Лазер 4.7, Лазер Радиал и Светлячок

source: Videography
ru: Видеография

# videography_desc
source: I love editing videos and shoot from my own drone
ru: Люблю монтировать видеоролики и сам снимаю с дрона

# programming_experience_header
source: Programming experience
ru: Опыт в программировании

# programming_experience_text
source: <p> I learned Python in the <a href="https://academy.yandex.ru/lyceum" target="_blank">Yandex Lyceum</a>, where I finished 2 courses (Basics of programming in Python and Basics of industrial programming). I have the most experience in writing backend for sites(Flask, SqlAlchemy) and bot creation (for Telegram and VK). I am familiar with the basics of HTML, CSS, JS and I am able to make the frontend for a website (this website layout was made by me). My projects are deployed on a rented Linux server in Europe. </p> <p> I usually code on my own but I used to work in a team hile I was studying in Yandex Lyceum and during the summer term in <a href="https://lksh.ru/" target="_blank">SIS</a> in July 2021 in the parallel P (parallel of industrial programming). I know how to work with a version control system Git and repositories on GitHub and Gitlab. </p> <p> I am constantly coming up with the ideas of new projects and enhancing old ones. In my free time I am improving my skills and learn new things by implementing my ideas. </p> <p> In 2021-2022, I learned C++, C# and blockchain in the <a href="https://informatics.ru/" target="_blank">School of programmers</a>. At the end of 2022, I passed a <a href="https://academy.yandex.ru/intensive/bigdata" target="_blank"> Big Data intensive by Yandex Academy</a>. In the future, I would like to delve into machine learning. </p> <p> I will be delighted to join any team project even if this will require learning lots of new technologies and stack. </p>
ru: <p> Python я изучал в <a href="https://academy.yandex.ru/lyceum" target="_blank">Яндекс Лицее</a>, где прошёл 2 курса (Основы программирования на языке Python и Основы промышленного программирования). Больше всего опыта у меня в написании бэкенда для сайтов (Flask, SqlAlchemy) и создании ботов (для Telegram и VK). Я знаком с основами HTML, CSS, JS и могу написать фронтенд для сайта (версткой этого сайта я занимался сам). Свои проекты я размещаю на арендованном Linux сервере в Европе. </p> <p> Обычно я программирую один, но мне доводилось работать в команде во время моего обучения в Яндекс Лицее и на летней смене <a href="https://lksh.ru/" target="_blank">ЛКШ</a> Июль 2021 в параллели P (параллель промышленного программирования). Я умею работать с системой контроля версий Git и репозиториями на GitHub и Gitlab. </p> <p> Мне постоянно приходят идеи новых проектов и улучшения старых. В своё свободное время я совершенствую свои навыки и изучаю новое, работая над реализацией своих идей. </p> <p> В 2021-2022 году изучал C++, C# и блокчейн в <a href="https://informatics.ru/" target="_blank">Школе программистов</a>. В конце 2022 года прошёл <a href="https://academy.yandex.ru/intensive/bigdata" target="_blank"> интенсив Академии Яндекса по большим данным</a>. В будущем хочу углубиться в тему машинного обучения и нейросетей. </p> <p> Я буду рад присоединиться к работе над совместным проектом, даже если для этого нужно будет изучить много нового материала. </p>

source: Projects
ru: Проекты

source: Source code
ru: Исходный код

source: All projects
ru: Все проекты

source: Contacts
ru: Контакты

# tg_channel_desc
source: Like, follow
ru: Лайк, подписка

# tg_channel_btn
source: My Telegram-channel
ru: Мой Telegram-канал

# footer_site_coded_with
source: Website&nbsp;coded with
ru: Сайт&nbsp;написан с

# footer_love
source: love
ru: любовью

# footer_by_me
source: by myself
ru: мной&nbsp;самим

# new_domain_lang
source: Переключить на русский
ru: Switch to English

# new_domain_header
source: Website moved!
ru: Сайт переехал!

# new_domain_text
source: You have been redirected to the new domain. If you followed the link I provided, please let me know by completing the form below, so I can update it, as the old domain will become inactive soon. Thank you!
ru: Вы были перенаправлены на новый домен. Если Вы использовали ссылку, оставленную мной, пожалуйста, сообщите об этом мне, воспользовавшись формой ниже, чтобы я успел исправить, пока старый домен еще доступен. Спасибо!

# new_domain_form_placeholder
source: Describe how you got here
ru: Опишите, как Вы попали на эту страницу

# new_domain_form_button
source: Submit
ru: Отправить

# new_domain_close_button
source: Hide
ru: Закрыть

# donate
source: Donations
ru: Донаты

# donate_description
source: Support the development of any of my projects by donating me! <br />1.5%% of your donation will also be contributed to removing CO<span class='fake-subscript'>₂</span> from the atmosphere
ru: Поддержите разработку любого моего проекта, сделав пожертвование! <br />1.5%% вашего доната пойдёт на удаление CO<span class='fake-subscript'>₂</span> из атмосферы

# donate_button
source: Donate with Stripe
ru: Пожертвовать через Stripe
